app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
                    <div class="col-10">
                        <%= f.collection_select(:category_ids, Category.all, :id, :name,
                        { prompt: 'Make your selection from the list below(can be empty)'},
                        { multiple: true , class: 'form-select shadow rounded'}) %>