app/views/users/index.html.erb

                        </h5>
                        <p class="card-text"> <%= pluralize(user.articles.count, "article")%></p>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]