app/controllers/articles_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Some article title"], ["description", "Description of article "], ["created_at", "2021-07-26 06:54:46.399494"], ["updated_at", "2021-07-26 06:54:46.399494"], ["user_id", 2]]
---
  def create
    @article = Article.new(articles_params)
    @article.user = User.first
    if @article.save

UPDATE "articles" SET "description" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["description", "edited- second article"], ["updated_at", "2021-07-23 10:28:24.518063"], ["id", 1]]
---
  def update
    if @article.update(articles_params)