app/controllers/users_controller.rb

  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-07-27 11:45:08.441036"], ["password_digest", "$2a$12$JYHqGlR8TLbaDA/4OrnkYOCVbGXyia51RVjoMxCJmfcYzTSW1bPD."], ["id", 2]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"