app/views/categories/index.html.erb

                    <div class="card-footer text-muted">
                        <small>Created <%= time_ago_in_words(category.created_at) %> ago,
                        edited <%= time_ago_in_words(category.updated_at)%> ago</small>
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Travel"], ["created_at", "2021-07-30 11:22:17.959587"], ["updated_at", "2021-07-30 11:22:17.959587"]]